<template>
  <dialog-element
    ref="dialog"
    class="terms-dialog"
    show-close-button
  >
    <div slot="content" class="terms">
      <div class="title">ข้อกำหนดและเงื่อนไข</div>
      <ol>
        <li>สิทธิพิเศษในการเข้าใช้งานอินเทอร์เน็ตการเรียนทางไกล DLTV (Distance Learning Television) ผ่านแอปพลิเคชั่นทรูไอดี และ เวปไซค์ DLTV และ เวปไซค์สถาบันการศึกษา โดยไม่มีค่าใช้จ่าย เป็นระยะเวลา 90 วัน (นับตั้งแต่วันที่สมัครและได้รับการยืนยันผ่าน SMS) นี้ สำหรับผู้ใช้บริการที่ใช้บริการเลขหมายโทรศัพท์เคลื่อนที่ ทรูมูฟ เอช ของบริษัท ทรูมูฟ เอช ยูนิเวอร์แซล คอมมิวนิเคชั่น จำกัด (“บริษัท”) ระบบรายเดือน หรือ ระบบเติมเงิน</li>
        <li>สิทธิพิเศษตามข้อ 1 สำหรับผู้ใช้บริการที่มีสถานะเป็นนักเรียน นิสิต-นักศึกษา หรือบุคลากรทางการศึกษาของสถาบันการศึกษาโดยมีรายละเอียดของเว็บไซต์ที่สามารถใช้บริการได้ปรากฏตามตารางรายชื่อสถานศึกษาด้านล่างนี้โดยผู้ใช้บริการต้องคงสถานะของการใช้บริการเลขหมายโทรศัพท์เคลื่อนที่ ทรูมูฟ เอช ของบริษัท ในระบบรายเดือน หรือ ระบบเติมเงินได้เป็นปกติ (Active)</li>
        <li>ผู้ใช้บริการสามารถขอรับสิทธิได้ในระหว่างวันที่ 25 มีนาคม 2563 ถึงวันที่ 31 กรกฎาคม 2563  หรือจนกว่าจะมีการแจ้งเปลี่ยนแปลงเป็นอย่างอื่น</li>
      </ol>
      <div class="sub">
        <div>เงื่อนไขการรับสิทธิ</div>
        <ol>
          <li>ผู้ใช้บริการจะต้องกดรับสิทธิพิเศษดังกล่าว ผ่านทาง <a href="https://www.truecorp.co.th" target="_blank" rel="noreferrer noopener">www.truecorp.co.th หรือ</a> ทรูไอดีแอปพลิเคชั่น และต้องได้รับการยืนยันเพื่อใช้บริการเว็บไซต์โดยไม่มีค่าใช้จ่ายเพิ่มเติม ผ่าน SMS ตามเลขหมายที่ได้ลงทะเบียนไว้แล้วเท่านั้น</li>
          <li>ผู้ใช้บริการจะได้รับสิทธิใช้อินเตอร์เน็ตไม่จำกัดสำหรับใช้บริการกลุ่มเว็บไซต์เพื่อการศึกษาที่ความเร็วสูงสุด 4 เมกกะบิตต่อวินาที (Mbps)(ความเร็วในการใช้บริการ4G/3G/EDGE/GPRS ขึ้นอยู่กับพื้นที่ให้บริการและจำนวนผู้ใช้บริการข้อมูลในพื้นที่ ณ เวลานั้น รวมถึงลักษณะของการใช้งาน ซึ่งอาจมีความเร็วต่ำกว่าที่ระบุในแพ็กเกจ)</li>
          <li>ผู้ใช้บริการสามารถใช้บริการกลุ่มเว็บไซต์เพื่อการศึกษารวมทั้งสิ้น 4,490 เว็บไซต์ ที่ลงท้ายด้วย .ac.th และ .edu เท่านั้น ในกรณีที่ ผู้ใช้บริการใช้เว็บไซต์อื่นหรือลิงค์อื่นที่ปรากฏบนหน้ากลุ่มเว็บไซต์เพื่อการศึกษาที่ไม่ได้ลงท้ายด้วย .ac.th และ .edu ผู้ใช้บริการจะต้องชำระค่าใช้บริการเพิ่มเติม (ถ้ามี) ตามอัตราที่ระบุในแพ็กเกจที่ผู้ใช้บริการเลือกใช้งานอยู่ ณ ขณะนั้น หรือหากในแพ็กเกจที่เลือกใช้ ไม่ได้ระบุไว้ ให้คิดค่าบริการตามเงื่อนไขที่บริษัทกำหนด โดยสามารถตรวจสอบรายชื่อของสถานศึกษาที่เข้าร่วมได้ โดย <a href="/files/university/University_URL_website.pdf" download>Download จาก PDF file</a></li>
          <li>ผู้ใช้บริการสามารถเรียนการศึกษาทางไกลผ่านทางทรูไอดีแอปพลิเคชั่นได้ทุกวัน ตั้งแต่เวลา 06:00-18:00 น. โดยสามารถตรวจสอบรายชื่อของสถานศึกษาที่เข้าร่วมได้ โดย <a href="/files/university/รายชื่อสถานศึกษา V2.pdf" download>Download จาก PDF file</a></li>
        </ol>
      </div>
    </div>
  </dialog-element>
</template>

<script>
  import Dialog from '@components/dialog'

  export default {
    components: {
      'dialog-element': Dialog
    },
    methods: {
      open () {
        this.$refs.dialog.open()
      }
    }
  }
</script>

<style lang="scss" scoped>
  .terms-dialog::v-deep {
    .content {
      max-width: 860px;

      .terms {
        padding: 36px 24px;

        .title {
          text-align: center;
          font-size: 26px;
          font-family: "TrueBold";
        }

        .sub {
          padding-top: 16px;
          padding-left: 20px;
        }

        a {
          color: #ff0000;
        }

        ol {
          padding-left: 20px;
        }
      }
    }
  }
</style>
