<template>
  <div class="terms">
    <p><b>เงื่อนไขการใช้ส่วนลดจากการแลกคะแนนสะสม</b></p>
    <ul class="dashed">
      <li>ส่วนลดจากการแลกคะแนนสะสมไม่สามารถใช้ร่วมกับคูปองโค้ดอื่นได้</li>
      <li>ส่วนลดจากการแลกคะแนนสะสมต้องน้อยกว่าหรือเท่ากับมูลค่าการสั่งซื้อเท่านั้น</li>
      <li>การคืนสินค้าจากการสั่งซื้อด้วยส่วนลดจากคะแนนสะสม</li>
    </ul>
    <p><b>เงินส่วนที่ลูกค้าชำระเพิ่มหลังหักส่วนลดจากคะแนนสะสม</b></p>
    <ul>
      <li>กรณีลูกค้าชำระเงินเต็มจำนวนหรือผ่อนชำระตัดผ่านบัตรเครดิตของธนาคารพาณิชย์ที่จดทะเบียนในประเทศไทยจะทำการคืนเงินกลับไปยังบัตรเครดิตที่ลูกค้าใช้ในการชำระเงินโดยใช้ระยะเวลาประมาณ 15-20 วันทำการนับจากวันที่ลูกค้าได้รับการแจ้งจาก Call Center โดยที่จะขึ้นอยู่กับรอบการตัดบัตรเครดิตของธนาคารเจ้าของบัตรของลูกค้า</li>
      <li>กรณีลูกค้าชำระเงินเต็มจำนวนตัดผ่านบัตรเดบิตของธนาคารพาณิชย์ที่จดทะเบียนในประเทศไทยจะทำการคืนเงินกลับไปยังบัตรเดบิตและบัตร web shopping card ที่ลูกค้าใช้ในการชำระเงินโดยใช้ระยะเวลาประมาณ 45 - 60 วันทำการนับจากวันที่ลูกค้าได้รับการแจ้งจาก Call Center โดยที่จะขึ้นอยู่กับเงื่อนไขของธนาคารเจ้าของบัตรของลูกค้านับจากวันที่ลูกค้าได้รับการแจ้งจาก Call Center โดยที่จะขึ้นอยู่กับรอบการตัดบัตรเครดิตของธนาคารเจ้าของบัตรของลูกค้า ทั้งนี้บริษัทฯขอสงวนสิทธิ์ในการคืนเงินเกินระยะเวลาที่กำหนดหากเกิดเหตุสุดวิสัย</li>
    </ul>
    <p><b>มูลค่าส่วนลดจากการแลกคะแนนสะสม</b></p>
    <ul>
      <li>บริษัทฯไม่สามารถคืนคะแนนสะสมได้ทุกกรณี</li>
      <li>มูลค่าส่วนลดที่ลูกค้าใช้คะแนนสะสมแลกเป็นส่วนลด (หลังหักโปรโมชั่นส่งเสริมการขายอื่น) จะคืนเป็นคูปองเงินสดเพื่อนำมาซื้อสินค้าที่www.wemall.com (จำนวนคะแนนสะสมที่ใช้ 1 คะแนนมูลค่า 0.1 บาท)</li>
    </ul>
    <ul class="dashed">
      <li>การสั่งซื้อสินค้าโดยใช้คะแนนสะสมสามารถทำได้โดยตัดคะแนน 1 ครั้งต่อ 1 รายการสั่งซื้อ (ไม่จำกัดใบรายการสั่งซื้อต่อวัน)</li>
      <li>ส่วนลดที่ได้จากการแลกคะแนนสะสมไม่สามารถโอน / เปลี่ยน / แลก / ทอนเป็นเงินสดได้</li>
      <li>บริษัทฯไม่มีส่วนเกี่ยวข้องกับเงื่อนไขการให้คะแนนสะสม</li>
      <li>บริษัทฯขอสงวนสิทธิ์ในการเปลี่ยนแปลงเงื่อนไขต่างๆรวมทั้งสิทธิประโยชน์โดยมิต้องแจ้งให้ทราบล่วงหน้าและหากมีข้อพิพาทคำตัดสินของบริษัทฯถือเป็นที่สิ้นสุด</li>
      <li>เงื่อนไขการใช้คะแนนสะสมเป็นไปตามที่บริษัทฯกำหนดและสามารถตรวจสอบรายละเอียดเพิ่มเติมที่ 02-900-9999</li>
    </ul>
  </div>
</template>

<style scoped lang="scss">
.terms {
  font-size: 20px;
  line-height: 20px;

  & > ol {
    padding: 0;
  }

  a {
    color: #37474f;
  }

  p {
    margin-top: 0;
  }

  b {
    font-family: "TrueBold";
  }

  .center {
    text-align: center;
  }

  .title {
    max-width: 320px;
    margin-left: auto;
    margin-right: auto;
  }

  p.no-margin-bottom {
    margin-bottom: 0;
  }

  li.no-bullet {
    &:before {
      opacity: 0;
      position: absolute;
      pointer-events: none;
    }
  }

  ul.dashed {
    list-style-type: none;
    padding-left: 35px;

    & > li {
      text-indent: -5px;
    }

    & > li:before {
      content: "-";
      text-indent: -5px;
      padding-right: 5px;
    }
  }

  ol.main {
    & > li {
      margin-bottom: 16px;
    }

    & > li:before {
      font-family: "TrueBold";
    }
  }

  ol {
    counter-reset: item;

    & > li {
      display: block;
    }
    & > li:before {
      content: counters(item, ".") ". ";
      counter-increment: item;
    }
  }

  ol.extra {
    padding-left: 40px;
    margin-top: 0;
  }
}

@media screen and (max-width: 860px) {
  .terms ul.dashed {
    padding-left: 20px;
  }
}

@media print {
  body[print] {
    .terms {
      font-size: 14px;
      line-height: 13px;
    }
    ol,
    ol.main {
      & > li {
        margin-bottom: 10px;
      }
    }
  }
}
</style>