<template>
  <dialog-element
    ref="dialog"
    class="terms-dialog"
  >
    <div slot="content">
      <div class="long-terms">
        <div class="title">ข้อกำหนดและเงื่อนไข</div>
        <div class="short-terms" v-html="terms" />
        <p class="content">
          เงื่อนไขและรายละเอียดรายการส่งเสริมการขายโครงการ  ทรู สเปเชียล<br>

          1. ข้อเสนอและสิทธิพิเศษต่างๆ ของรายการส่งเสริมการขายโครงการ ทรู สเปเชียล นี้สำหรับลูกค้าผู้ใช้บริการทรูปัจจุบัน “ลูกค้า” ที่ใช้บริการต่างๆ อันได้แก่ บริการอินเทอร์เน็ต ของบริษัท ทรู อินเทอร์เน็ต คอร์ปอเรชั่น จำกัด (“ทรู อินเทอร์เน็ต”), บริการโทรศัพท์เคลื่อนที่ ทรูมูฟ เอช ทั้งแบบรายเดือนและแบบเติมเงิน ของบริษัท ทรู มูฟ เอช ยูนิเวอร์แซล คอมมิวนิเคชั่น จำกัด(“ทรูมูฟ เอช”) และ บริการโทรทัศน์ในระบบบอกรับเป็นสมาชิก จากบริษัท ทรู วิชั่นส์ กรุ๊ป จำกัด (“ทรู วิชั่นส์”) และ/หรือบุคคลที่สาม (ถ้ามี) รวมเรียกว่า “บริษัท”<br>

          2. ข้อเสนอและสิทธิพิเศษต่างๆในรายการส่งเสริมการขายโครงการ  ทรู สเปเชียล นี้จะถูกแบ่งเป็นรายการส่งเสริมการขายย่อยตามประเภทการสมัครบริการในรูปแบบต่อไปนี้<br>
            - การสมัครเปิดใช้บริการใหม่<br>
            - การสมัครเพิ่มบริการ หรือ การเปลี่ยนแปลงแพ็กเกจที่สูงขึ้น<br>
            - การซื้อบริการเสริมหรือแพ็กเกจเสริมต่างๆ <br>

          โดยข้อเสนอบริการต่างๆ ในรายการส่งเสริมการขายย่อยถือเป็นส่วนหนึ่งตามเงื่อนไขและข้อกำหนดของรายการส่งเสริมการขายต่างๆ ของบริษัท ที่เสนอให้กับบุคคลทั่วไป หรือ ลูกค้าปัจจุบัน ที่ใช้รายการส่งเสริมการขายอื่นนอกจากรายการส่งเสริมการขายโครงการ  ทรู สเปเชียล<br>

          3. การรับข้อเสนอรูปแบบต่างๆ ที่ระบุไว้ในรายการส่งเสริมการขายย่อย อาจมีสิทธิพิเศษเพิ่มเติมและข้อกำหนดแตกต่างกันไป โดยสิทธิพิเศษต่างๆ ลูกค้าจะได้รับต่อเมื่อลูกค้ามีการปฏิบัติตามข้อเสนอที่มีการแจ้งไว้ในสื่อประชาสัมพันธ์แล้วเท่านั้น<br>

          4. ข้อเสนอ และหรือสิทธิพิเศษต่างๆ ของรายการส่งเสริมการขายย่อยในรายการส่งเสริมการขายโครงการ  ทรู สเปเชียลไม่สามารถใช้ร่วมกับรายการส่งเสริมการขาย โปรโมชั่น หรือส่วนลดอื่น ๆ ได้<br>

          5. ข้อเสนอและสิทธิพิเศษ ดังกล่าว เป็นการเสนอระบุให้เฉพาะตัวบุคคล ไม่สามารถโอนสิทธิ์หรือส่งต่อให้กับผู้อื่นได้ เว้นแต่มีการกำหนดไว้เป็นกรณีไป อันได้แก่ การโอนสิทธิ์ส่งต่อให้กับ บุคคลในครอบครัว และบุคคลที่มีการระบุตัวตนชัดเจน<br>

          6. กรณีที่ลูกค้ามีการเปลี่ยนแปลงรายละเอียดการใช้งานที่ไม่เป็นไปตามเงื่อนไขของรายการส่งเสริมการขายย่อยรวมถึงมีค่าบริการค้างชำระ หรือค่าธรรมเนียมใด ๆ ที่เกี่ยวข้องกับการใช้บริการตามบริการแพ็กเกจหลัก จนทำให้เกิดการระงับสัญญาณ หรือกระทำผิดเงื่อนไขของการใช้บริการของ บริษัท สิทธิพิเศษต่างๆ ที่ได้รับเพิ่มจะสิ้นสุดลงทันที<br>

          7. ช่องทางในการประชาสัมพันธ์และ การรับข้อเสนอของลูกค้า ประกอบด้วย ศูนย์บริการข้อมูลลูกค้าทางโทรศัพท์ (Call Center), ทรูช้อป, เว็บไซด์, ข้อความสั้น (SMS), แอพพลิเคชั่นต่างๆ ของบริษัท ซึ่งขึ้นอยู่กับการให้บริการแต่ละประเภทตามรายการส่งเสริมการขายที่กำหนด<br>

          8. ระยะเวลา ของรายการส่งเสริมการขายโครงการ  ทรู สเปเชียล นี้ เริ่มตั้งแต่วันที่ 1 มิถุนายน 2563 ถึงวันที่ 31 ธันวาคม 2563  โดยที่แต่ละรายการส่งเสริมการขายย่อยจะมีเวลาเริ่มต้นและสิ้นสุดไม่เท่ากัน ซึ่งบริษัทจะมีการระบุไว้ในข้อความหรือชิ้นงานโฆษณาประชาสัมพันธ์ตามแต่ละรายการส่งเสริมการขายย่อย<br>

          9. หากลูกค้ากระทำการอันเป็นการอย่างใดอย่างหนึ่งดังต่อไปนี้ บริษัท มีสิทธิในการยกเลิกการให้บริการตามสัญญาได้ทันที<br>
          <span class="ml-1">9.1 กระทำการฝ่าฝืนข้อห้ามในสัญญา: หากลูกค้ากระทำผิดวัตถุประสงค์แห่งสัญญา ให้ถือเป็นการฝ่าฝืนข้อห้ามในสัญญา
          "วัตถุประสงค์แห่งสัญญา": ลูกค้าจะต้อง<br></span>
          <span class="ml-1">(ก.) ใช้บริการตามรายการส่งเสริมการขายนี้เพื่อการสื่อสารเฉพาะตนโดยมีเจตนาสุจริตตามวิธีการใช้ บริการเยี่ยงปกติประเพณีของบุคคลธรรมดาทั่วไปที่จะพึงกระทำเท่านั้น มิใช่เพื่อประโยชน์ หรือสิ่งอื่นใดที่อาจถือเอาประโยชน์ได้ และจะไม่นำบริการไปใช้แสวงหาประโยชน์ไม่ว่าในลักษณะใด ๆ ในเชิงพาณิชย์หรือนำไปให้บริการต่อ<br></span>
          <span class="ml-1">(ข.) ไม่ใช้ ไม่นำบริการมาใช้ ไม่ดัดแปลง หรือไม่กระทำการใดๆ ในเทคโนโลยีหรือระบบหรือสิ่งอื่นใดเพื่อเชื่อมต่อหรือเกี่ยวข้องกับการใช้บริการดังกล่าว รวมทั้งไม่กระทำการ อันมีลักษณะหรือคาดหมายได้หรือ เชื่อได้ว่าจะก่อให้เกิดการผิดศีลธรรมหรือเกิดความเสียหายหรือเกิดความไม่เป็นธรรมต่อบริษัท หรือบุคคลอื่นใด ทั้งในทางตรงและทางอ้อม หรือไม่ทำการรบกวน หรือก่อความไม่สะดวก หรือเป็นอันตรายต่อเครือข่าย หรือทำให้ประสิทธิภาพการปฏิบัติงานของเครือข่ายหรือส่วนใดๆ ของเครือข่าย เกิดความขัดข้องไม่เป็นไปตามปกติ<br></span>
          <span class="ml-1">(ค.) ลูกค้าจะโอนสิทธิการใช้บริการตามสัญญานี้ให้แก่บุคคลอื่นก่อนครบกำหนดระยะเวลาตามสัญญามิได้ เว้นแต่จะได้รับความยินยอมจากบริษัท<br></span>

          <span class="ml-1">9.2 กระทำการที่มีเหตุผลอันเชื่อได้ว่าลูกค้าทุจริตหรือมีการปลอมแปลงเอกสารในการสมัครใช้หรือรับข้อเสนอของบริการหรือมีพฤติกรรมฉ้อฉลในการใช้บริการหรือนำบริการไปใช้โดยผิดกฎหมาย<br></span>

          10. บริษัท มีสิทธิในการแก้ไข เปลี่ยนแปลง หรือยกเลิกข้อกำหนดและเงื่อนไขใดๆ โดยจะแจ้งให้ทราบล่วงหน้าผ่านช่องทางตามที่บริษัท พิจารณาเห็นสมควร และเว้นแต่จะได้ระบุไว้โดยแจ้งชัดเป็นอย่างอื่น กรณีข้อกำหนดและเงื่อนไขการใช้บริการข้างต้นของโครงการนี้ ขัดหรือแย้งกับข้อกำหนดของเงื่อนไขฉบับเต็ม ให้ยึดตามข้อกำหนดและเงื่อนไขฉบับเต็มเป็นหลัก<br>
          11. รายการส่งเสริมการขายนี้อยู่ภายใต้เงื่อนไขที่บริษัทกำหนด ลูกค้าจะต้องศึกษาข้อมูลเพิ่มเติมก่อนเลือกใช้บริการที่ www.truemoveh.com หรือ ทรูมูฟ เอช แคร์ โทร 1242 หรือสอบถามพนักงานขาย<br>
        </p>
      </div>
    </div>
  </dialog-element>
</template>

<script>
  import Dialog from '@components/dialog'

  export default {
    components: {
      'dialog-element': Dialog
    },
    props: {
      campBean: Object
    },
    data: () => ({
      shortTerms: ''
    }),
    computed: {
      terms () {
        return this.campBean ? this.campBean.terms : this.shortTerms
      }
    },
    methods: {
      open (e) {
        if (e) this.shortTerms = e.terms
        this.$refs.dialog.open()
      }
    }
  }
</script>

<style lang="scss" scoped>
  .long-terms {
    text-align: left;
  }
</style>
