<html>

<head>
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
    <style>
        @font-face {
            font-family: 'TrueMedium';
            src: url("{{ resource_path('fonts/TrueMedium/true_medium-webfont.ttf') }}") format('truetype');
            font-weight: normal;
            font-style: normal;
        }

        @font-face {
            font-family: 'TrueBold';
            src: url("{{ resource_path('fonts/TrueBold/true_bold-webfont.ttf') }}") format('truetype');
            font-weight: bold;
            font-style: normal;
        }

        body {
            font-family: 'TrueMedium', 'TrueBold';
            font-size: 24px;
            line-height: 24px;
            color: #37474f;
            margin: 0;
        }

        

        .success-container {
            text-align: center;
            font-size: 26px;
            line-height: 28px;
            padding: 0 16px 32px 16px;
            width: 100%;
            border-bottom: 1px solid #c5c5c5;
        }

        .success-container .success-message {
            color: #64ae61;
            font-size: 40px;
            line-height: 40px;
            margin: 24px 0;
        }

        .success-container .order-id {
            color: #212121;
            font-size: 40px;
            line-height: 40px;
        }

        .delivery-container {
            width: 100%;
            padding: 32px 16px;
            font-size: 26px;
            line-height: 28px;
        }

        .delivery-container .delivery-description {
            margin-top: 16px;
        }

        .delivery-container .address {
            padding-left: 20px;
            font-size: 22px;
            line-height: 20px;
            margin: 8px 0 32px 0;
        }

        .terms-container {
            border-top: 1px solid #c5c5c5;
            padding: 64px 0 48px 0;
        }

        .terms {
            font-size: 14px;
            line-height: 13px;
        }
        .terms > ol {
            padding: 0;
        }
        .terms a {
            color: #37474f;
        }
        .terms p {
            margin-top: 0;
        }
        .terms b {
            font-family: "TrueBold";
        }
        .terms .center {
            text-align: center;
        }
        .terms .title {
            max-width: 320px;
            margin-left: auto;
            margin-right: auto;
        }
        .terms p.no-margin-bottom {
            margin-bottom: 0;
        }
        .terms li.no-bullet:before {
            opacity: 0;
            position: absolute;
            pointer-events: none;
        }
        .terms ul.dashed {
            list-style-type: none;
            padding-left: 35px;
        }
        .terms ul.dashed > li {
            text-indent: -5px;
        }
        .terms ul.dashed > li:before {
            content: "-";
            text-indent: -5px;
            padding-right: 5px;
        }
        .terms ol.main > li {
            margin-bottom: 10px;
        }
        .terms ol.main > li:before {
            font-family: "TrueBold";
        }
        .terms ol {
            counter-reset: item;
        }
        .terms ol > li {
            display: block;
        }
        .terms ol > li:before {
            content: counters(item, ".") ". ";
            counter-increment: item;
        }
        .terms ol.extra {
            padding-left: 40px;
            margin-top: 0;
        }
    </style>
</head>

<body>
    <div class="page-container">
        <div class="success-container">
            <div class="success-message">ชำระเงินเรียบร้อย</div>
            <div class="success-description">ร้านค้าได้รับคำสั่งซื้อของคุณแล้ว หมายเลขการสั่งซื้อ
            </div>
            <div class="order-id">{{ $order_id }}</div>
            <div class="success-description">ระบบได้ส่งอีเมลยืนยันการสั่งซื้อให้คุณเรียบร้อย</div>
        </div>
        <div class="delivery-container">
            <div class="delivery-description">สรุปรายการสั่งซื้อ</div>
            <div class="delivery-description">หมายเลขการสั่งซื้อ {{ $order_id }}</div>
            <div class="delivery-description">ที่อยู่จัดส่ง</div>
            <div class="address">
                <div>{{ $order_address["delivery_firstname"] }} {{ $order_address["delivery_lastname"] }}</div>
                <div>{{ $order_address["delivery_address_1"] }} {{ $order_address["delivery_address_2"] }}</div>
                <div>{{ $order_address["delivery_district"] }}</div>
                <div>{{ $order_address["delivery_postcode"] }} {{ $order_address["delivery_city"] }}</div>
                <div>{{ $order_address["delivery_province"] }}</div>
                <div class="address-country">ประเทศไทย</div>
                <div>Phone No: {{ $order_address["delivery_phone"] }}</div>
                <div>Email: {{ $order_address["delivery_email"] }}</div>
            </div>
            <div class="delivery-description">ที่อยู่ในการออกใบเสร็จ/ใบกำกับภาษี</div>
            <div class="address">
                <div>{{ $order_address["billing_firstname"] }} {{ $order_address["billing_lastname"] }}</div>
                <div>{{ $order_address["billing_address_1"] }} {{ $order_address["billing_address_2"] }}</div>
                <div>{{ $order_address["billing_district"] }}</div>
                <div>{{ $order_address["billing_postcode"] }} {{ $order_address["billing_city"] }}</div>
                <div>{{ $order_address["billing_province"] }}</div>
                <div class="address-country">ประเทศไทย</div>
                <div>Tax No: {{ $order_address["billing_tax_no"] }}</div>
                <div>Branch: {{ $order_address["billing_branch"] }}</div>
                <div>Phone No: {{ $order_address["billing_phone"] }}</div>
                <div>Email: {{ $order_address["billing_email"] }}</div>
            </div>
        </div>
        <div class="terms-container">
            <div class="terms">
x                <p class="center title"><b>ข้อกำหนดและเงื่อนไขการสั่งซื้อสินค้าบน <br>เว็บไซต์ store.truecorp.co.th</b></p>
                <p>เพื่อให้ลูกค้าได้รับความพึงพอใจในการซื้อสินค้าบนเว็บไซต์ store.truecorp.co.th บริษัท ทรู ดิสทริบิวชั่น แอนด์ เซลส์ จำกัด (“บริษัทฯ”) มีข้อกำหนดและเงื่อนไข ดังนี้</p>
                <ol class="main">
                    <li><b>นโยบายการรับประกันสินค้า</b>
                    <p>บริษัทฯ มีการรับประกันสินค้า ขึ้นอยู่กับประเภทของสินค้า โดยจะอยู่ภายใต้การพิจารณาของบริษัทฯ ซึ่งการรับประกันของสินค้าแต่ละรายการมีความแตกต่างกัน ดังนั้นลูกค้าจะต้องตรวจสอบรายละเอียดการรับประกันสินค้าที่ต้องการสั่งซื้อก่อนทำการซื้อสินค้า ซึ่งสามารถดูได้จากหน้ารายละเอียดสินค้า</p>
                    <p>บริษัทฯ ขอสงวนสิทธิ์ในการพิจารณาตรวจสอบก่อนจัดส่งสินค้าใหม่ให้แก่ลูกค้า</p>
                    </li>
                    <li><b>นโยบายการคืนเงินและการยกเลิกคำสั่งซื้อ</b>
                    <p>บริษัทฯ จะทำการคืนเงินค่าสินค้าให้กับลูกค้า ในกรณีที่บริษัทฯ ไม่สามารถจัดส่งสินค้าตามที่ลูกค้าสั่งซื้อได้ โดยระยะเวลาการคืนเงินค่าสินค้า มีรายละเอียดดังนี้</p>
                    <ul class="dashed">
                        <li>กรณีลูกค้าชำระเงินเต็มจำนวนหรือผ่อนชำระ ตัดผ่านบัตรเครดิตของธนาคารพาณิชย์ที่จดทะเบียนในประเทศไทย บริษัทฯ จะส่งเรื่องขอคืนเงินไปยังธนาคาร โดยการคืนเงินจะขึ้นอยู่กับนโยบายของแต่ละธนาคาร ตามปกติแล้วผู้ถือบัตรจะได้รับเงินคืนในรอบบิลถัดไป</li>
                        <li>กรณีลูกค้าชำระเงินเต็มจำนวน ตัดผ่านช่องทาง True Money Wallet จะทำการคืนเงินกลับไปยัง True Money Wallet ที่ลูกค้าใช้ในการชำระเงิน โดยใช้ระยะเวลาประมาณ 7-14 วันทำการ</li>
                        <li>กรณีลูกค้าชำระเงินเต็มจำนวน ตัดผ่านบัตรเดบิตของธนาคารพาณิชย์ที่จดทะเบียนในประเทศไทย บริษัทจะส่งเรื่องขอคืนเงินไปยังธนาคาร โดยการคืนเงินจะขึ้นอยู่กับนโยบายของแต่ละธนาคาร ซึ่งจะใช้ระยะเวลาในการคืนเงินตั้งแต่ 30-60 วัน นับจากวันที่ลูกค้าได้รับการแจ้งจาก Call Center</li>
                    </ul>
                    <br>
                    <p>ลูกค้าไม่สามารถดำเนินการยกเลิก เปลี่ยนแปลง แก้ไข รายการสั่งซื้อสินค้า ในกรณีต่างๆ ดังนี้</p>
                    <ul class="dashed">
                        <li>กรณีที่เกิดขึ้นจากความผิดพลาดในการสั่งซื้อสินค้า ผิดสี, ผิดรุ่น, ผิดประเภท</li>
                        <li>กรณีที่เกิดขึ้นจากการเปลี่ยนแปลงของราคาสินค้าที่อาจเกิดขึ้นได้ในอนาคตรวมถึง Gift Voucher ต่างๆ ทุกกรณีที่เกิดขึ้นจากความต้องการใส่ส่วนลดเพิ่มเติม, ลืมใส่ส่วนลด หรือ Coupon</li>
                        <li>กรณีที่เกิดขึ้นจากการเปลี่ยนใจ (Change of mind) ของผู้สั่งซื้อสินค้าทุกกรณี</li>
                    </ul>
                    <br>
                    <p>บริษัทฯ จะไม่ดำเนินการจัดส่งสินค้า และต้องทำการคืนเงินเท่านั้น เนื่องจากกรณีต่างๆ ดังนี้</p>
                    <ul class="dashed">
                        <li>กรณีที่เกิดขึ้นจากสินค้าหมด (เช่น สินค้าหมด Stock, สินค้ายกเลิกการผลิตฯ)</li>
                        <li>กรณีที่เกิดขึ้นจากราคาสินค้าที่ระบุทางหน้าเว็บไซต์ไม่ตรงกับราคาที่จำหน่ายจริง</li>
                        <li>กรณีที่เกิดขึ้นจากเหตุสุดวิสัย (System Error) ที่อาจเกิดขึ้น</li>
                    </ul>
                    <br>
                    <p>บริษัทฯ ขอสงวนสิทธิ์ในการคืนเงินเกินระยะเวลาที่กำหนด หากเกิดเหตุสุดวิสัยและขอสงวนสิทธิในการเปลี่ยนแปลงเงื่อนไขใดๆ โดยไม่จำต้องแจ้งให้ทราบล่วงหน้า</p>
                    </li>
                    <li><b>นโยบายการจัดส่งสินค้า</b>
                    <ul class="dashed">
                        <li>ค่าจัดส่งเป็นไปตามเงื่อนไขของแต่ละโปรโมชั่นสินค้า ดังนั้นลูกค้าจะต้องตรวจสอบรายละเอียดค่าจัดส่งจากหน้าโปรโมชั่นสินค้า</li>
                        <li>ระยะเวลาในการจัดส่งสินค้า จะอยู่ที่ 2-5 วันทำการในเขตกทม.และปริมณฑล และ 2-7 วันทำการทั่วประเทศ ขึ้นอยู่กับบริษัทผู้ให้บริการขนส่ง และพื้นที่จัดส่งสินค้า โดยไม่นับวันเสาร์-อาทิตย์ วันหยุดนักขัตฤกษ์ และวันหยุดราชการ</li>
                        <li>บริษัทฯ จะเริ่มนับระยะเวลาการจัดส่งสินค้าหลังจากที่ลูกค้าได้รับ SMS หรือ E-Mail ยืนยันการสั่งซื้อสินค้าที่มีการชำระเงินเต็มจำนวนสำเร็จเท่านั้น โดยประเภทการจัดส่งสินค้าขึ้นอยู่กับบริษัทฯกำหนด</li>
                        <li>ลูกค้าไม่สามารถเปลี่ยนแปลงที่อยู่จัดส่งสินค้า เมื่อได้ทำการสั่งซื้อสินค้าเรียบร้อยแล้ว</li>
                        <li>บริการจัดส่งสินค้าเฉพาะภายในประเทศไทยเท่านั้น สำหรับการจัดส่งสินค้าในพื้นที่ 3 จังหวัดชายแดนภาคใต้ (ยะลา ปัตตานี และ นราธิวาส) ระยะเวลาในการจัดส่ง จะขึ้นอยู่กับสถานการณ์ในช่วงเวลานั้นๆ โดยทางบริษัทฯ จะจัดส่งให้ตามความเหมาะสม</li>
                        <li>เนื่องจากนโยบายการจัดส่งสินค้าของสินค้าแต่ละรายการมีความแตกต่างกัน ลูกค้าสามารถตรวจสอบนโยบายการจัดส่งสินค้าก่อนทำการซื้อสินค้าได้ โดยอ่านรายละเอียดนโยบายการจัดส่งสินค้าในหน้ารายละเอียดสินค้าแต่ละรายการ</li>
                        <li>รายการสินค้าที่สั่งซื้อจากเลขที่สั่งซื้อเดียวกัน อาจมีนโยบายการจัดส่งแตกต่างกัน ลูกค้าอาจได้รับสินค้าไม่พร้อมกัน</li>
                        <li>บริษัทฯ ขอสงวนสิทธิ์ในการเปลี่ยนแปลงเงื่อนไขใดๆ โดยไม่จำต้องแจ้งให้ทราบล่วงหน้า</li>
                    </ul>
                    </li>
                    <li><b>นโยบายคุ้มครองข้อมูลส่วนบุคคล</b>
                    <p>บริษัทฯ ตระหนักถึงความสำคัญของประเด็นการคุ้มครองข้อมูลส่วนบุคคลในเครือข่ายอินเทอร์เน็ต และเชื่อว่าเป็นสิ่งสำคัญต่อผู้ใช้บริการทุกท่านที่จะทราบว่าบริษัทฯจัดการข้อมูลส่วนบุคคลที่ได้รับจากผู้ใช้บริการอย่างไร</p>
                    <p>โดยทั่วไปแล้วผู้ใช้บริการสามารถเข้าเยี่ยมชมเว็บไซต์ของบริษัทได้โดยมิต้องแจ้งให้บริษัทฯ ทราบว่าผู้ใช้บริการเป็นใคร รวมทั้งไม่ต้องเปิดเผยข้อมูลส่วนบุคคลต่างๆที่เกี่ยวกับผู้ใช้บริการ เว็บเซิร์ฟเวอร์ของบริษัทจะบันทึกเพียงชื่อโดเมนเท่านั้น จะไม่บันทึกที่อยู่ของอีเมล์ของผู้เข้าชมเว็บไซต์ ข้อมูลต่างๆที่ได้รับการรวบรวมไว้จะนำมาใช้สำหรับการนับจำนวนผู้เข้าเยี่ยมชม ระยะเวลาโดยเฉลี่ยของการเข้าชมเว็บไซต์ของบริษัทฯ หรือการเข้าชมแต่ละเว็บเพจเป็นต้น เพื่อนำมาใช้ในการปรับปรุงเนื้อหาเว็บไซต์ของบริษัทฯ ต่อไป</p>
                    <p>อย่างไรก็ดีหากบริษัทฯ มีความประสงค์ที่จะจัดเก็บข้อมูลของผู้ใช้บริการ เช่น ชื่อและที่อยู่ บริษัทฯ จะพยายามแจ้งให้ผู้ใช้บริการทราบว่าเมื่อใดที่จะทำการจัดเก็บและวัตถุประสงค์ของการจัดเก็บข้อมูลส่วนบุคคลของผู้ใช้บริการ โดยปกติแล้วข้อมูลที่บริษัทฯ จัดเก็บจะถูกใช้โดยบริษัทฯ เท่านั้นเพื่อใช้ในการตอบคำถามของผู้ใช้บริการ ดำเนินการเกี่ยวกับคำขอของผู้ใช้บริการ หรืออนุญาตให้ผู้ใช้บริการเข้าถึงข้อมูลที่มีลักษณะพิเศษได้ในบางโอกาส บริษัทฯอาจให้ที่อยู่อีเมล์ของผู้ใช้บริการแก่องค์กรที่มีชื่อเสียงซึ่งมีผลิตภัณฑ์หรือการบริการที่บริษัทฯ พิจารณาว่าน่าจะเป็นสนใจต่อผู้ใช้บริการ ในกรณีเหล่านี้ผู้ใช้บริการมีสิทธิที่จะสร้างข้อจำกัดในการเข้าถึงข้อมูลส่วนบุคคลของผู้ใช้บริการได้</p>
                    <p>หากผู้ใช้บริการได้ลงทะเบียนไว้กับธุรกิจออนไลน์ในเครือของบริษัทแห่งใดแห่งหนึ่งข้อมูลของผู้ใช้บริการอาจถูกนำไปใช้โดยบริษัทเหล่านั้น  เพื่อเสนอสิ่งที่อยู่ในความต้องการทางธุรกิจของท่านเทคโนโลยีที่เรียกว่าคุ๊กกี้ (Cookie) อาจมีการนำมาใช้เพื่อนำเสนอข้อมูลที่ได้รับการออกแบบให้ตรงกับความต้องการของผู้ใช้บริการ (Cookie) คุกกี้เป็นองค์ประกอบย่อยของข้อมูลที่เว็บไซต์จะส่งไปยังบราวเซอร์ของผู้ใช้บริการ หลังจากนั้นคุกกี้จะถูกนำไปเก็บไว้ในฮาร์ดดิสในคอมพิวเตอร์ของผู้ใช้บริการ ซึ่งจะทำให้บริษัทฯ ทราบได้เมื่อผู้ใช้บริการกลับมาเยี่ยมชมเว็บไซต์ของบริษัทฯในครั้งต่อไป โดยคุกกี้จะทำให้บริษัทฯ สามารถจัดการเกี่ยวกับความสนใจของผู้ใช้บริการได้อย่างเหมาะสม เพื่อจะทำให้ผู้ใช้บริการกลับมาเยี่ยมชมเว็บไซต์ของบริษัทฯ ได้มากขึ้นอีก อย่างไรก็ตามผู้ใช้บริการสามารถที่จะกำหนดบราวเซอร์ให้แจ้งต่อผู้ใช้บริการ เมื่อผู้ใช้บริการได้รับคุกกี้ได้ การใช้งานคุ๊กกี้จะไม่เกี่ยวโยงกับข้อมูลส่วนบุคคลของผู้ใช้บริการขณะที่ผู้ใช้บริการกำลังใช้งานในเว็บไซต์ของบริษัทฯ</p>
                    <p>ในบางโอกาสบริษัทฯ อาจทำการสำรวจทางออนไลน์เพื่อความเข้าใจที่ดีขึ้นต่อความต้องการและข้อมูลของผู้เข้าเยี่ยมชมเว็บไซต์ของบริษัท เมื่อบริษัทฯ จะดำเนินการสำรวจดังกล่าว บริษัทฯ จะพยายามแจ้งให้ผู้ใช้บริการทราบว่าบริษัทฯจะนำข้อมูลของผู้ใช้บริการที่ได้การจัดเก็บทางอินเตอร์เน็ทไปใช้ดำเนินการอย่างไร การเข้าร่วมการสำรวจเหล่านั้นจะเกิดจากความสมัครใจ ดังนั้นผู้ใช้บริการสามารถเลือกที่จะเปิดเผยหรือไม่เปิดเผยข้อมูลส่วนบุคคลของผู้ใช้บริการก็ได้</p>
                    <p>เมื่อผู้ใช้บริการออกจากเว็บไชต์นี้แล้วขอให้ผู้ใช้บริการระมัดระวังและโปรดอ่านนโยบายคุ้มครองข้อมูลส่วนบุคคลของแต่ละเว็บไซต์ที่มีการเก็บข้อมูลส่วนบุคคลที่ผู้ใช้บริการต้องการเข้าไปเยี่ยมชมด้วย</p>
                    <p>นโยบายคุ้มครองข้อมูลส่วนบุคคลที่ได้กล่าวมาแล้วข้างต้นจะใช้บังคับเฉพาะข้อมูลที่ได้มีการจัดโดยเว็บไชต์นี้เท่านั้น หากผู้ใช้บริการคิดว่าบริษัทฯ ไม่ได้ปฎิบัติตามนโยบายคุ้มครองข้อมูลส่วนบุคคลข้างต้น ผู้ใช้บริการสามารถดำเนินการติดต่อ Call Center โทร. 02-020-2354 เวลาทำการ จันทร์-ศุกร์ (เว้นวันหยุดนักขัตฤกษ์) เวลา 09:00 - 18:00 น. หรือ อีเมล support@wemall.com</p>
                    </li>
                </ol>
            </div>
        </div>
    </div>
</body>

</html>