<template>
  <dialog-element
    ref="dialog"
    class="terms-dialog"
  >
    <div slot="content">
      <div class="long-terms" v-if="isTol">
        <div class="title">เงื่อนไขการสมัครบริการแพ็กเกจทรู ซูเปอร์ ไฟเบอร์ สปีด บูทส์ (True Super Fiber Speed Boost) แบบต่ออายุอัตโนมัติ</div>
        <div class="tol">
          <div>เงื่อนไขทั่วไป สำหรับการสมัคร และใช้บริการแพ็กเกจทรู ซูเปอร์ ไฟเบอร์ สปีด บูทส์ (True Super Fiber Speed Boost) แบบต่ออายุอัตโนมัติ แพ็กเกจทรู ซูเปอร์ ไฟเบอร์ สปีด บูทส์ (“True Super Fiber Speed Boost”) แบบต่ออายุอัตโนมัติ ให้บริการโดยบริษัท ทรู อินเทอร์เน็ต คอรปอเรชั่น จำกัด (“ทรู อินเทอร์เน็ต คอร์ปอเรชั่น”) โดยผู้ใช้บริการสามารถซื้อแพ็กเกจดังกล่าวได้ในระหว่างวันที่ 5 มีนาคม 2563 – 31 ธันวาคม 2563True Super Fiber Speed Boost แบบต่ออายุอัตโนมัติ แบ่งเป็น 3 แพ็กเกจ โดยมีรายละเอียดดังนี้</div>
          <div>1. บริการอินเทอร์เน็ตความเร็วสูงสุด (ดาวน์โหลด/อัพโหลด) 300/300 Mbps. แบบต่ออายุอัตโนมัติ ราคา 59 บาท/30 วัน (ราคานี้ยังไม่รวม Vat 7%)</div>
          <div>2. บริการอินเทอร์เน็ตความเร็วสูงสุด (ดาวน์โหลด/อัพโหลด) 500/500Mbps. แบบต่ออายุอัตโนมัติ อัตโนมัติ ราคา 89 บาท/30 วัน (ราคานี้ยังไม่รวม Vat 7%)</div>
          <div>3. บริการอินเทอร์เน็ตความเร็วสูงสุด (ดาวน์โหลด/อัพโหลด) 1000/200Mbps. แบบต่ออายุอัตโนมัติ อัตโนมัติ ราคา 99 บาท/30 วัน (ราคานี้ยังไม่รวม Vat 7%)</div>
        </div>
        <div class="title left">เงื่อนไขการรับสิทธิ :</div>
        <div class="tol">
          <div>1. ผู้ใช้บริการต้องจดทะเบียนใช้บริการอินเตอร์เน็ตกับ ทรู อินเทอร์เน็ต คอร์ปอเรชั่น ในนามบุคคลธรรมดาแบบรายเดือนตามแพ็กเกจอินเตอร์เน็ตหลักก่อน (เฉพาะประเภท 1 บัญชีผู้ใช้บริการ/BAN ต่อ 1 ผู้ใช้บริการ/Subscriber) จึงจะมีสิทธิสมัครใช้บริการแพ็กเกจเสริม True Super Fiber Speed Boost เพื่อใช้ความเร็วสูงสุดเพิ่มขึ้นตามแพ็กเกจเสริมดังกล่าว โดยผู้ใช้บริการรับทราบและตกลงปฏิบัติตามข้อกำหนดและเงื่อนไขนี้ทุกประการ</div>
          <div>2. ความเร็วสูงสุด คือ ความเร็วสูงสุดที่สัญญาณวิ่งมาจากชุมสายมาจนถึงอุปกรณ์โมเด็ม หรือ อุปกรณ์กระจายสัญญาที่ติดตั้งภายในที่พักอาศัย ทั้งนี้ ขึ้นอยู่กับปัจจัยแวดล้อมอื่นด้วย อาทิ อุปกรณ์ภาครับและภาคส่ง และการใช้งานเว็บไซต์ต่างๆ เป็นต้น ผู้ใช้บริการจะได้รับบิลแจ้งค่าบริการ True Super Fiber Speed Boost ตามระยะเวลาของแพ็กเกจที่สมัคร และจะเป็นการคิดค่าบริการต่อเนื่องแบบอัตโนมัติ ตลอดอายุการใช้งาน จนกว่าจะมีการแจ้งขอยกเลิกบริการตามเงื่อนไขที่บริษัทกำหนด โดยผู้ใช้บริการตกลงชำระค่าบริการตามแพ็กเกจหลักภายในระยะเวลากำหนดชำระตามบิลแจ้งค่าบริการ เพื่อหลีกเลี่ยงการถูกยุติสิทธิการใช้บริการ True Super Fiber Speed Boost นี้ และถูกระงับการใช้บริการอินเทอร์เน็ตตามแพ็กเกจหลักด้วย ทั้งนี้ ผู้ใช้บริการสามารถชำระเงินได้สะดวกมากขึ้น ผ่านแอปพลิเคชั่นทรูไอเซอร์วีส, ทรูมันนี่เซอร์วีส, เซเว่น อิเลฟเว่น, เทสโก้โลตัส, ทรูช้อป, เคาน์เตอร์เซอร์วีส, ธนาคาร, ผ่านเครื่อง ATM หรือระบบอินเตอร์เน็ตแบงค์กิ้ง, หักผ่านบัตรเครดิต หรือบัญชีธนาคาร เป็นต้น</div>
          <div>3. ผู้ใช้บริการสามารถเลือกรับสิทธิยืมอุปกรณ์เพิ่มเติม เพื่อเชื่อมต่ออินเทอร์เน็ต “อุปกรณ์ Gigabit WiFi Router” ตามมาตรฐานการติดตั้งบริการที่ทางบริษัทกำหนด ซึ่งการรับสิทธิพิเศษข้างต้น ถือเป็นส่วนหนึ่งของคําขอ/สัญญาใช้บริการในกลุ่มทรู โดยผู้ใช้บริการตกลงต่ออายุและใช้บริการตามคําขอ/สัญญาใช้บริการดังกล่าวต่อเนื่องไปอีก เป็นระยะเวลา 12 เดือน สำหรับการสมัครบริการ แพ็กเกจเสริม True Super Fiber Speed Boost ความเร็ว 300/100 mbps. และความเร็ว 500/100 mbps. /หรือ/ ระยะเวลา 24 เดือน สำหรับการสมัครบริการ แพ็กเกจเสริม True Super Fiber Speed Boost ความเร็ว 1000/100 mbps. “นับจากวันที่ครบระยะเวลาการใช้บริการตามคําขอ/สัญญาใช้บริการเดิม” กรณี อุปกรณ์ Gigabit WiFi Router ที่ยืม ชำรุด หรือไม่สามารถใช้งานได้ ด้วยเหตุจากผู้ผลิต หรือเกิดจากการใช้งานตามปกติ, บริษัทฯ มีสิทธิในการเปลี่ยนอุปกรณ์ทดแทนให้ ภายในช่วงระยะเวลาสัญญารับสิทธิยืม และมีสิทธิในการเรียกเก็บคืนอุปกรณ์ชุดที่ไม่สามารถใช้งานได้</div>
          <div>4. อุปกรณ์ตามสิทธิยืมนี้เป็นทรัพย์สินของบริษัทฯ และเนื่องจากผู้ยืมได้สมัครใช้บริการฯ ตามสัญญานี้ บริษัทฯ จึงนำอุปกรณ์ที่ยืมดังกล่าวข้างต้นออกให้ผู้ใช้บริการยืมตาม สัญญานี้ และผู้ใช้บริการไม่สามารถโอนสิทธิให้กับบุคคลอื่นได้ และต้องส่งคืนบริษัทฯเมื่อยกเลิกบริการ หากไม่ส่งคืนจะต้องชำระเงินค่าอุปกรณ์ Gigabit WiFi Router คืนให้กับบริษัทฯ เป็นเงิน 3,900 บาท โดยราคายังไม่รวมภาษีมูลค่าเพิ่ม</div>
          <div>5. ทรู อินเทอร์เน็ต คอร์ปอเรชั่น มีสิทธิที่จะบอกเลิก/ระงับการให้บริการ True Super Fiber Speed Boost ได้ทันที หากมีการนำบริการ แพ็กเกจ True Super Fiber Speed Boost ไปใช้งานในทางที่ไม่ถูกต้อง หรือขัดต่อกฎหมาย หรือเป็นเหตุให้เกิดความ เสียหายต่อชื่อเสียงของทรู อินเทอร์เน็ต คอร์ปอเรชั่น หรือมีการเคลื่อนย้าย ดัดแปลง แก้ไข หรือนำอุปกรณ์อื่นมาเชื่อมต่อ หรือผู้ใช้บริการผิดสัญญาข้อหนึ่งข้อใด ทรู อินเทอร์เน็ต คอร์ปอเรชั่น มีสิทธิที่จะบอกเลิก/ระงับการให้บริการอินเทอร์เน็ต หากผู้ใช้บริการเข้าข่ายการใช้งานผิดประเภท อาทิ การใช้งานในลักษณะแชร์โครงข่ายอินเทอร์เน็ตเพื่อการค้าอีกทอดหนึ่งไปยังกลุ่มผู้ใช้บริการของตนเอง หรือ ใช้งานเพื่อโหลดบิตทอร์เรนต์จำนวนมากไปยังโครงข่ายคอมพิวเตอร์หรือเซิร์ฟเวอร์ที่ใดที่หนึ่งเป็นประจำและเป็นระยะเวลาต่อเนื่อง จนเป็นเหตุให้ผู้ใช้บริการรายอื่นได้รับผลกระทบในการใช้งานอินเทอร์เน็ตในพื้นที่เดียวกัน หรือสร้างความเสียหายอย่างใดอย่างหนึ่งกับโครงข่ายอินเทอร์เน็ตของบริษัทในภาพรวม</div>
          <div>6. ผู้ใช้บริการยินยอมให้เก็บรวบรวมใช้ หรือเปิดเผยข้อมูลส่วนบุคคลที่ใช้สมัครบริการ รวมถึงข้อมูลส่วนบุคคล หรือข้อมูลการใช้บริการหรือข้อมูลใดๆ ที่บริษัทได้รับหรือรวบรวมผ่านการใช้บริการที่ได้สมัครไว้ เพื่อวัตถุประสงค์ในการให้บริการที่มีประสิทธิภาพหรือเพื่อการเสนอหรือให้สิทธิประโยชน์แก่ผู้ใช้บริการ หรือเพื่อวัตถุประสงค์ในการวิจัยตลาดและการส่งเสริมการขาย หรือเพื่อการพัฒนาเครือข่าย หรือเพื่อการพัฒนาปรับปรุงบริการ หรือเพื่ออำนวยความสะดวกในการแจ้งหรือการชำระค่าบริการ หรือเพื่อวิเคราะห์และนำเสนอบริการ หรือเพื่อความปลอดภัย หรือระงับอันตรายต่อชีวิต ร่างกาย หรือสุขภาพอนามัยของบุคคล รวมตลอดถึงกิจการที่จะต้องปฏิบัติตามกฎหมายและ/หรือมีเหตุจำเป็นอื่นใดตามที่เห็นสมควร โดยบริษัทสามารถเปิดเผยข้อมูลดังกล่าวข้างต้นให้แก่บริษัทในเครือ เครือกิจการ เครือธุรกิจ หรือนิติบุคคลหรือบุคลลอื่นใดๆ ที่บริษัทเป็นคู่สัญญาหรือมีนิติสัมพันธ์อยู่ด้วย ทั้งนี้ เอกสารตัวจริงสำหรับผู้ใช้บริการเก็บไว้เป็นหลักฐาน เอกสารอิเลกทรอนิกส์จะจัดเก็บที่บริษัทในกลุ่มทรู</div>
          <div>7. ในกรณีที่ผู้ใช้บริการมีหนี้ค้างชำระใดๆ ในแพ็กเกจการใช้บริการหลัก ผู้ใช้บริการจะต้องดำเนินการชำระหนี้ที่ค้างให้ครบถ้วนทั้งจำนวนก่อน จึงจะสามารถสมัคร แพ็กเกจเสริม True Super Fiber Speed Boost ได้ และหากผู้ใช้บริการสมัครแพ็กเกจเสริม True Super Fiber Speed Boost แล้ว ผู้ใช้บริการสามารถใช้บริการตามความเร็วสูงสุดดาวน์โหลด/อัพโหลดที่แพ็กเกจเสริมกำหนดไว้เท่านั้น และเมื่อครบกำหนดระยะเวลาและผู้ใช้บริการขอยกเลิกแพ็กเกจเสริม True Super Fiber Speed Boost กับทรู อินเทอร์เน็ต คอร์ปอเรชั่น แล้ว ความเร็วการดาวน์โหลด/อัพโหลด</div>
          <div>8. ทรู อินเทอร์เน็ต คอร์ปอเรชั่นมีสิทธิในการยกเลิกการให้สิทธิพิเศษข้างต้นนี้ได้ทันที หากมีข้อกำหนด คำสั่ง หรือนโยบายของหน่วยงานของรัฐที่เกี่ยวข้องกำหนดให้มีการแก้ไข เปลี่ยนแปลง ระงับ หรือยกเลิกเงื่อนไขของบริการใดๆ หรือคำสั่งดังกล่าวเป็นการเพิ่มภาระในการดำเนินการของ ทรู อินเทอร์เน็ต คอร์ปอเรชั่น เว้นแต่จะได้ระบุไว้โดยชัดแจ้งเป็นอย่างอื่น ทรู อินเทอร์เน็ต คอร์ปอเรชั่น มีสิทธิในการแก้ไข เปลี่ยนแปลง ระงับ หรือยกเลิกเงื่อนไขใดๆ ในสิทธิพิเศษข้างต้นนี้ได้ตามความเหมาะสมโดยจะแจ้งให้ทราบล่วงหน้าอย่างน้อย 30 วัน ผ่านช่องทางที่ “ทรู อินเทอร์เน็ต คอร์ปอเรชั่น” พิจารณาเห็นสมควร ผู้ใช้บริการได้อ่านและเข้าใจข้อกำหนดและเงื่อนไขในแต่ละบริการ รวมทั้งเงื่อนไขของแพ็กเกจที่สมัครใช้บริการโดยตลอดก่อนขอรับสิทธิและ/หรือสมัครใช้บริการแล้ว ตกลงปฏิบัติตามข้อกำหนดและเงื่อนไขข้างต้นโดยเคร่งครัดทุกประการด้วยความสมัครใจ</div>
        </div>
      </div>
      <div class="long-terms" v-if="!isTol">
        <div class="title">ข้อกำหนดและเงื่อนไข</div>
        <div>{{ packageName }}</div>
        <div>สอบถามข้อกำหนดและเงื่อนไขเพิ่มเติม กรุณาติดต่อ True Call Center โทร. 1242</div>
      </div>
    </div>
  </dialog-element>
</template>

<script>
  import Dialog from '@components/dialog'

  export default {
    components: {
      'dialog-element': Dialog
    },
    data: () => ({
      packageName: String,
      isTol: Boolean
    }),
    methods: {
      showTermsDialog () {
        this.$refs.dialog.open()
      }
    }
  }
</script>

<style lang="scss" scoped>
  .long-terms > div {
    margin-bottom: 8px;
  }

  .long-terms .left {
    text-align: left;
  }

  .long-terms .tol {
    text-align: left;
    line-height: 1.1;
  }
</style>
